package com.eomcs.basic.ex03;

// 정수 리터럴(literal) - 정수를 메모리에 저장하는 방법

public class Exam24 {
  public static void main(String[] args) {
    // 23
    // => 0000 0000 0000 0000 0000 0000 0001 0111
    System.out.println(23);

    // -23
    // Sign-magnitude => 1000 0000 0000 0000 0000 0000 0001 0111  맨 왼쪽 1비트를 부호 비트로 사용한다.
    System.out.println(-23);
    
    // 23 + (-23) = 0 ?
    // =>
    // 0000 0000 0000 0000 0000 0000 0001 0111
    // 1000 0000 0000 0000 0000 0000 0001 0111
    // ---------------------------------------
    // 1000 0000 0000 0000 0000 0000 0010 1110 = -46
    // Sign-magnitude 방식은 23 + (-23)의 결과가 옳게 나오지 않는다.

    // 1's complement(1의 보수)
    // 모든 비트를 반전. 0을 1로 1을 0으로
    // 0000 0000 0000 0000 0000 0000 0001 0111  (23)
    // 1111 1111 1111 1111 1111 1111 1110 1000  (-23)
    // ---------------------------------------
    // 1111 1111 1111 1111 1111 1111 1111 1111
    //+                                      1
    // ---------------------------------------
    //10000 0000 0000 0000 0000 0000 0000 0000 = 0 올림수 1은 버림.
    // 항상 음수를 더할 때 결과에 1을 추가해야 한다.

    // 2's complement(2의 보수)
    // 1의 보수로 저장된 음수 값을 더할 때마다 계산 결과에 1을 추가하는 번거로움을 없애기 위해
    // 미리 음수를 저장할 때 미리 1을 추가해두는 방법
    // => 1의 보수 +1 => 2의 보수
    // 1111 1111 1111 1111 1111 1111 1110 1001 (-23)
    // 0000 0000 0000 0000 0000 0000 0001 0111  (23)
    // ---------------------------------------
    //10000 0000 0000 0000 0000 0000 0000 0000 = 0
    // 그래서 컴퓨터에서 음수를 메모리에 저장할 때는
    // 양수와 음수를 더할 때 정상적인 값이 나오도록
    // 2의 보수 방법으로 음수를 저장한다. (현대 대부분 컴퓨터, C, Java, python 등 대부분 언어에서 2의보수로 음수를 저장)
    // 
    // 


  }
}