package com.eomcs.basic.ex05;

//# 비트 이동 연산자 : 비트 이동의 유효 범위
//
public class Exam04_11 {
  public static void main(String[] args) {
    System.out.println(3 << 1);//6
    //  00000000 00000000 00000000 00000011 = 3
    // 0|000000 00000000 00000000 000000110 = 6
    
    System.out.println(3 << 33);//6
    System.out.println(3 << 32);//3
    System.out.println(3 << 31);//-2147483648
    System.out.println(3 << 65); //6
    System.out.println(3 << 97); //6
    // int 비트 이동 유효범위 : 0 ~ 31
    // 32를 넘는다면 32로 나눈 나머지 값만큼 비트 이동
    // long 비트 이동 유효범위 : 0 ~ 63
    // 64를 넘는다면 64로 나눈 나머지 값만큼 비트 이동
    // 유효범위를 벗어난다면?
    // => int 데이터인 경우 비트 이동 값은 하위 5비트만 유효하다.
    // => long 데이터인 경우 비트 이동 값은 하위 6비트만 유효하다.
    //    공식)
    //    n << s
    //    - n이 int 타입이라면, s & 0b11111 = 비트 이동
    //    - n이 long 타입이라면, s & 0b111111 = 비트 이동
    //    예1)
    //    3 << 33
    //    00000000 00000000 00000000 00000011 = 3
    //    00000000 00000000 00000000 00010001 = 33
    //    
    //    00000000 00000000 00000000 00100001
    //   &00000000 00000000 00000000 00011111
    //   ------------------------------------
    //    00000000 00000000 00000000 00000001
    //    
  }
}
