package com.eomcs.basic.ex03;

// 부동 소수점 리터럴(literal) - 부동소수점의 리터럴은 기본이 왜 8바이트인가?
// 

public class Exam342 {
  public static void main(String[] args) {
    System.out.println(54345.66f);
    System.out.println(11.23456f);
    // 54345.66     (7자리:ok)
    //+   11.23456  (7자리:ok)
    //------------
    // 54356.89456  (10자리: 계산결과가 유효자리수를 넘는다)

    System.out.println(54345.66f + 11.23456f); //54356.895
    //실행결과를 보면 기대했던 수가 출력되지 않는다.
    //피연산 수는 유효자리수이지만,
    //계산결과는 유효자리수를 넘어가기 때문이다.
    //=> 이렇게 작은 부동소수점도 유효자리수를 쉽게 넘어간다.
    //때문에 JAVA는 기본으로 8바이트 메모리를 사용한다.

    //JAVA로 프로그래밍을 할 때 부동소수점은 8바이트로 다루자!
    
  }
}
