package com.eomcs.basic.ex04;

public class Exam21 {
  public static void main(String[] args) {
    // 정수 변수 - 메모리 크기
    byte b; // 1byte 0000 0000 ~ 1111 1111 = 00 ~ ff = -128 ~ 127
    b = -128;
    b = 127;
    // b = -129; 오류!
    // b = 128; 오류!

    short s; // 2byte : -32768 ~ 32767
    s = -32768;
    s = 32767;

    // s = -32769; 오류!
    // s = 32768; 오류!

    int i; // 4byte : 약 -21억 ~ 21억
    i = -21_0000_0000;
    i = 21_0000_0000;

    // i = -22_0000_0000; 오류!
    // i = 22_0000_0000; 오류!

    long l; // 8byte : 약 -922경 ~ 922경
    l = -922_0000_0000_0000_0000L;
    l = 922_0000_0000_0000_0000L;

    // l = -923_0000_0000_0000_0000L; 오류!
    // l = 923_0000_0000_0000_0000L; 오류!

  }
}